/*Напишите объявление о продаже чего - нибудь и выведите его на экран, в том виде как оно должно было бы быть
напечатано.*/

#include <iostream>

using namespace std;

int main()
{
	cout << R"(		
		Wonderful Samoyed puppies are offered for sale ! A boy and a girl are free.
		2 months.
		from a couple of multiple champions :
		Father is a Champion of the RKF, a Champion of Russia (WWII; WWII; BIG; I; SW; LPP; SAS; CACIV)
		Mother is a Champion of the RKF, Champion of Russia (J CAC; CAC; WWII; WWII; CRKF; CR; LPI; SNC).

		Dogs of this breed are companions, human - oriented, 
		equally adapted to living both in an apartment and in a private house(just not on a chain)!
		Samoyeds are hardworking, smart, funny, unpretentious, 
		but very loyal!Their wool is self - cleaning, hypoallergenic, odorless.They're not slobbery.
		All puppies at the time of moving will be fully processed and vaccinated by age!
		They will have RKF documents, a stamp, vet.passport and microchip(international standard optional).
		Delivery in Russia and Europe is possible.We are waiting for the most responsible owners, 
		we guarantee consultationsand assistance in education!
		I will answer all your questions about SAMOYEDS by phone !
		Do not hesitate - CALL!!!
		8-918-463-34-52)" << endl;

	cout << R"(		
		|	8	|	8	|	8	|	8	|	8	|	8	|
		|	-	|	-	|	-	|	-	|	-	|	-	|
		|	9	|	9	|	9	|	9	|	9	|	9	|
		|	1	|	1	|	1	|	1	|	1	|	1	|
		|	8	|	8	|	8	|	8	|	8	|	8	|
		|	-	|	-	|	-	|	-	|	-	|	-	|
		|	4	|	4	|	4	|	4	|	4	|	4	|
		|	6	|	6	|	6	|	6	|	6	|	6	|
		|	3	|	3	|	3	|	3	|	3	|	3	|
		|	-	|	-	|	-	|	-	|	-	|	-	|
		|	3	|	3	|	3	|	3	|	3	|	3	|
		|	4	|	4	|	4	|	4	|	4	|	4	|
		|	-	|	-	|	-	|	-	|	-	|	-	|
		|	5	|	5	|	5	|	5	|	5	|	5	|
		|	2	|	2	|	2	|	2	|	2	|	2	|)" << endl;

	return 0;
}
  /*Предлагаются к продаже замечательные щенки самоедов ! Свободны мальчик и девочка.
	2 мес.
	от пары Многократных чемпионов:
	Отец - Чемпион РКФ, Чемпион России (ВОВ; ВОS; ВIG; ВIS; СW; ПП; САС; САСIВ)
	Мать - Чемпионка РКФ, Чемпионка России (JСАС; САС; ВОВ; ВОS; ЮЧРКФ; ЧР; ЛПИ; СНС).

	Собаки этой породы - компаньоны, ориентированы на человека, 
	одинаково приспособлены к проживанию как в квартире, так и в частном доме (только не на цепь)!
	Самоеды - трудолюбивые, умные, весёлые, неприхотливые, но очень преданные! 
	Их шерсть - самоочищающаяся, гипоаллергенная, не имеет запаха. Они не слюнявые.
	Все щенки на момент переезда будут полностью обработаны и привиты по возрасту! 
	Будут иметь документы РКФ, клеймо, вет. паспорт и микрочип (международного образца по желанию).
	Возможна доставка по России и Европе. Ждём самых ответственных хозяев, 
	гарантируем консультации и помощь в воспитании !
	По телефону отвечу на все интересующие Вас вопросы по САМОЕДАМ !
	Не стесняйтесь - ЗВОНИТЕ!!!*/