/*Вывести на экран стих «Every hunter wants…» таким образом, чтобы каждый «цвет» начинался с новой строки и
соответствующим количеством табуляций.*/
#include <iostream>

using namespace std;

int main(){

	cout << endl;

	cout << R"(	Every
	hunter
	wishes
	know
	where
	he sits
	Pheasant)" << endl;

	/*	Каждый 
		охотник 
		желает 
		знать, 
		где 
		сидит 
		Фазан*/

	return 0;
}
